Modul15Full/src/Documents/МУ_Доставка/МУ_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МУ_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Modul15Full/src/Documents/МУ_Доставка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		 Запрос = Новый Запрос(
 		 "ВЫБРАТЬ
 		 |	МУ_Доставка.Договор,
 		 |	МУ_Доставка.Комментарий,
 		 |	МУ_Доставка.Контрагент,
 		 |	МУ_Доставка.Организация,
 		 |	МУ_Доставка.Основание,
 		 |	МУ_ДоставкаТовары.Номенклатура,
 		 |	МУ_ДоставкаТовары.Количество
 		 |ИЗ
 		 |	Документ.МУ_Доставка.Товары КАК МУ_ДоставкаТовары
 		 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МУ_Доставка КАК МУ_Доставка
 		 |		ПО МУ_ДоставкаТовары.Ссылка = МУ_Доставка.Ссылка
 		 |ГДЕ
 		 |	МУ_Доставка.Ссылка = &Ссылка");
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
 
		 Выборка = Запрос.Выполнить().Выбрать();
		 Выборка.Следующий();

	
			
		Договор = Выборка.Договор;
		Комментарий = Выборка.Комментарий;
		Контрагент = Выборка.Контрагент;
		Организация = Выборка.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь();
		Основание = Выборка.Ссылка;
		Для Каждого ТекСтрокаТовары Из Выборка.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
